tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jnsahaj/lumen"
tap "mutagen-io/mutagen"
tap "runpod/runpodctl"
brew "ansible"
brew "atuin"
brew "autocorrect"
brew "automake"
brew "bind"
brew "caddy"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "consul"
brew "coreutils"
brew "difftastic"
brew "direnv"
brew "elixir"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gost"
brew "harper"
brew "pkgconf"
brew "helm"
brew "htop"
brew "imagemagick"
brew "ipfs"
brew "just"
brew "k3sup"
brew "k9s"
brew "kubernetes-cli"
brew "lefthook"
brew "libimobiledevice"
brew "luarocks"
brew "mackup"
brew "miniserve"
brew "neovim"
brew "node"
brew "nomad"
brew "pgweb"
brew "protobuf"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "s3cmd"
brew "shellcheck"
brew "shfmt"
brew "sops"
brew "ssh-copy-id"
brew "starship"
brew "stylua"
brew "subversion"
brew "telnet"
brew "tldr"
brew "trash-cli", link: true
brew "tree"
brew "upx"
brew "uv"
brew "vips"
brew "watchexec"
brew "websocat"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"
brew "zplug"
brew "jnsahaj/lumen/lumen"
brew "mutagen-io/mutagen/mutagen"
brew "runpod/runpodctl/runpodctl"
cask "balenaetcher"
cask "chromedriver"
cask "discord"
cask "font-hack-nerd-font"
cask "ghostty"
cask "godot"
cask "iterm2"
cask "neovide"
cask "ollama"
cask "tailscale"
cask "visual-studio-code"
vscode "codium.codium"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "vscodevim.vim"
vscode "wy-z.vscode-vim-mode"
