tap "domt4/autoupdate"
tap "facebook/fb"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "macos-fuse-t/cask"
tap "mutagen-io/mutagen"
tap "oven-sh/bun"
tap "runpod/runpodctl"
brew "age"
brew "tree"
brew "ansible"
brew "ast-grep"
brew "atuin"
brew "autocorrect"
brew "bind"
brew "caddy"
brew "clang-format"
brew "cliproxyapi"
brew "cloc"
brew "node"
brew "cloudflare-wrangler"
brew "cloudflared"
brew "cmake"
brew "consul"
brew "coreutils"
brew "difftastic"
brew "direnv"
brew "elixir"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "gdtoolkit"
brew "gemini-cli"
brew "gh"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gost"
brew "harper"
brew "pkgconf"
brew "htop"
brew "imagemagick"
brew "just"
brew "k3sup"
brew "k9s"
brew "kubernetes-cli"
brew "lefthook"
brew "libimobiledevice"
brew "luarocks"
brew "mackup"
brew "miniserve"
brew "mise"
brew "mole"
brew "neovim"
brew "neovide"
brew "neovim-remote"
brew "nomad"
brew "oxipng"
brew "pgweb"
brew "postgresql@18", restart_service: :changed, link: true
brew "prettier"
brew "protobuf"
brew "redis", restart_service: :changed
brew "repomix"
brew "ripgrep"
brew "rsync"
brew "rtk"
brew "rustup"
brew "s3cmd"
brew "scons"
brew "shellcheck"
brew "shfmt"
brew "sops"
brew "ssh-copy-id"
brew "starship"
brew "stylua"
brew "subversion"
brew "ta-lib"
brew "telnet"
brew "tldr"
brew "trash-cli", link: true
brew "typescript"
brew "upx"
brew "uv"
brew "vips"
brew "watchexec"
brew "websocat"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"
brew "facebook/fb/idb-companion"
brew "mutagen-io/mutagen/mutagen"
brew "oven-sh/bun/bun"
brew "runpod/runpodctl/runpodctl"
cask "1password-cli"
cask "balenaetcher"
cask "blender"
cask "codex"
cask "discord"
cask "font-hack-nerd-font"
cask "macos-fuse-t/cask/fuse-t"
cask "ghostty"
cask "godot"
cask "orbstack"
cask "tailscale-app"
cask "visual-studio-code"
vscode "bierner.markdown-mermaid"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "vscodevim.vim"
vscode "wy-z.vscode-vim-mode"
uv "cocoindex-code[full]"
uv "llm"
npm "ctx7"
npm "oh-my-claude-sisyphus"
