tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "ansible"
brew "aspell"
brew "atuin"
brew "autocorrect"
brew "automake"
brew "caddy"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "elixir"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gost"
brew "helm"
brew "htop"
brew "imagemagick"
brew "ipfs", restart_service: true
brew "jq"
brew "just"
brew "k3sup"
brew "k9s"
brew "kubernetes-cli"
brew "libimobiledevice"
brew "luarocks"
brew "mackup"
brew "mdbook"
brew "miniserve"
brew "neovim"
brew "nomad"
brew "pgweb"
brew "postgresql@14", restart_service: true
brew "protobuf"
brew "qemu"
brew "redis", restart_service: true
brew "rsync"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "sops"
brew "ssh-copy-id"
brew "starship"
brew "stylua"
brew "subversion"
brew "telnet"
brew "tldr"
brew "tree"
brew "upx"
brew "uv"
brew "vault", restart_service: true
brew "vips"
brew "watchexec"
brew "websocat"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zplug"
cask "balenaetcher"
cask "chromedriver"
cask "discord"
cask "font-hack-nerd-font"
cask "godot"
cask "gstreamer-runtime"
cask "iterm2"
cask "microsoft-remote-desktop"
cask "neovide"
cask "orbstack"
cask "tailscale"
cask "tigervnc-viewer"
cask "visual-studio-code"
cask "wine-stable"
vscode "asvetliakov.vscode-neovim"
vscode "editorconfig.editorconfig"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
